Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz3_wbz35/apps/ble/building_blocks/peripheral/ext_adv/firmware/src/packs/WBZ351_DFP/component/fuses.h
/*
 * Component description for FUSES
 *
 * Copyright (c) 2023 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2023-02-01T05:15:15Z */
#ifndef _WBZ35_FUSES_COMPONENT_H_
#define _WBZ35_FUSES_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR FUSES                                        */
/* ************************************************************************** */

/* -------- FUSES_ALTFBCFG7 : (FUSES Offset: 0x00) (R/W 32) RESERVED -------- */
#define FUSES_ALTFBCFG7_RESETVALUE            _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_ALTFBCFG7) RESERVED  Reset Value */

#define FUSES_ALTFBCFG7_Msk                   _UINT32_(0x00000000)                                 /* (FUSES_ALTFBCFG7) Register Mask  */


/* -------- FUSES_ALTFBCFG6 : (FUSES Offset: 0x04) (R/W 32) RESERVED -------- */
#define FUSES_ALTFBCFG6_RESETVALUE            _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_ALTFBCFG6) RESERVED  Reset Value */

#define FUSES_ALTFBCFG6_Msk                   _UINT32_(0x00000000)                                 /* (FUSES_ALTFBCFG6) Register Mask  */


/* -------- FUSES_ALTFUSERID : (FUSES Offset: 0x08) (R/W 32) ALT USERID -------- */
#define FUSES_ALTFUSERID_RESETVALUE           _UINT32_(0xFFFF)                                     /*  (FUSES_ALTFUSERID) ALT USERID  Reset Value */

#define FUSES_ALTFUSERID_Msk                  _UINT32_(0x00000000)                                 /* (FUSES_ALTFUSERID) Register Mask  */


/* -------- FUSES_ALTDEVCFG4 : (FUSES Offset: 0x0C) (R/W 32) ALT CFGCON4 Fuses -------- */
#define FUSES_ALTDEVCFG4_RESETVALUE           _UINT32_(0x840E4000)                                 /*  (FUSES_ALTDEVCFG4) ALT CFGCON4 Fuses  Reset Value */

#define FUSES_ALTDEVCFG4_Msk                  _UINT32_(0x00000000)                                 /* (FUSES_ALTDEVCFG4) Register Mask  */


/* -------- FUSES_ALTDEVCFG2 : (FUSES Offset: 0x10) (R/W 32) ALT CFGCON2 Fuses -------- */
#define FUSES_ALTDEVCFG2_RESETVALUE           _UINT32_(0x5F74FF38)                                 /*  (FUSES_ALTDEVCFG2) ALT CFGCON2 Fuses  Reset Value */

#define FUSES_ALTDEVCFG2_Msk                  _UINT32_(0x00000000)                                 /* (FUSES_ALTDEVCFG2) Register Mask  */


/* -------- FUSES_ALTDEVCFG1 : (FUSES Offset: 0x14) (R/W 32) ALT CFGCON1 Fuses -------- */
#define FUSES_ALTDEVCFG1_RESETVALUE           _UINT32_(0x1410443B)                                 /*  (FUSES_ALTDEVCFG1) ALT CFGCON1 Fuses  Reset Value */

#define FUSES_ALTDEVCFG1_Msk                  _UINT32_(0x00000000)                                 /* (FUSES_ALTDEVCFG1) Register Mask  */


/* -------- FUSES_ALTDEVCFG0 : (FUSES Offset: 0x18) (R/W 32) ALT CFGCON0 Fuses -------- */
#define FUSES_ALTDEVCFG0_RESETVALUE           _UINT32_(0x7100000B)                                 /*  (FUSES_ALTDEVCFG0) ALT CFGCON0 Fuses  Reset Value */

#define FUSES_ALTDEVCFG0_Msk                  _UINT32_(0x00000000)                                 /* (FUSES_ALTDEVCFG0) Register Mask  */


/* -------- FUSES_ALTFBCFG0 : (FUSES Offset: 0x1C) (R/W 32) ALT NVR BCFG0 -------- */
#define FUSES_ALTFBCFG0_RESETVALUE            _UINT32_(0x80000002)                                 /*  (FUSES_ALTFBCFG0) ALT NVR BCFG0  Reset Value */

#define FUSES_ALTFBCFG0_Msk                   _UINT32_(0x00000000)                                 /* (FUSES_ALTFBCFG0) Register Mask  */


/* -------- FUSES_ALTFCPN3 : (FUSES Offset: 0x30) (R/W 32) RESERVED -------- */
#define FUSES_ALTFCPN3_RESETVALUE             _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_ALTFCPN3) RESERVED  Reset Value */

#define FUSES_ALTFCPN3_Msk                    _UINT32_(0x00000000)                                 /* (FUSES_ALTFCPN3) Register Mask  */


/* -------- FUSES_ALTFCPN2 : (FUSES Offset: 0x34) (R/W 32) RESERVED -------- */
#define FUSES_ALTFCPN2_RESETVALUE             _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_ALTFCPN2) RESERVED  Reset Value */

#define FUSES_ALTFCPN2_Msk                    _UINT32_(0x00000000)                                 /* (FUSES_ALTFCPN2) Register Mask  */


/* -------- FUSES_ALTFCPN1 : (FUSES Offset: 0x38) (R/W 32) RESERVED -------- */
#define FUSES_ALTFCPN1_RESETVALUE             _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_ALTFCPN1) RESERVED  Reset Value */

#define FUSES_ALTFCPN1_Msk                    _UINT32_(0x00000000)                                 /* (FUSES_ALTFCPN1) Register Mask  */


/* -------- FUSES_ALTFCPN0 : (FUSES Offset: 0x3C) (R/W 32) ALT NVR CPN Register -------- */
#define FUSES_ALTFCPN0_RESETVALUE             _UINT32_(0x10000000)                                 /*  (FUSES_ALTFCPN0) ALT NVR CPN Register  Reset Value */

#define FUSES_ALTFCPN0_Msk                    _UINT32_(0x00000000)                                 /* (FUSES_ALTFCPN0) Register Mask  */


/* -------- FUSES_FBCFG7 : (FUSES Offset: 0x100) (R/W 32) RESERVED -------- */
#define FUSES_FBCFG7_RESETVALUE               _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_FBCFG7) RESERVED  Reset Value */

#define FUSES_FBCFG7_Msk                      _UINT32_(0x00000000)                                 /* (FUSES_FBCFG7) Register Mask  */


